```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.firebase_android_app_id will be destroyed
  # (because github_actions_secret.firebase_android_app_id is not in configuration)
  - resource "github_actions_secret" "firebase_android_app_id" {
      - created_at      = "2025-07-25 12:11:25 +0000 UTC" -> null
      - id              = "playground.ashdavies.dev:FIREBASE_ANDROID_APP_ID" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "playground.ashdavies.dev" -> null
      - secret_name     = "FIREBASE_ANDROID_APP_ID" -> null
      - updated_at      = "2025-07-25 12:11:25 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # github_actions_secret.firebase_google_services will be destroyed
  # (because github_actions_secret.firebase_google_services is not in configuration)
  - resource "github_actions_secret" "firebase_google_services" {
      - created_at      = "2025-07-26 12:20:54 +0000 UTC" -> null
      - id              = "playground.ashdavies.dev:FIREBASE_GOOGLE_SERVICES" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "playground.ashdavies.dev" -> null
      - secret_name     = "FIREBASE_GOOGLE_SERVICES" -> null
      - updated_at      = "2025-07-26 12:20:54 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # github_actions_secret.google_service_account_id will be destroyed
  # (because github_actions_secret.google_service_account_id is not in configuration)
  - resource "github_actions_secret" "google_service_account_id" {
      - created_at      = "2025-07-25 11:21:53 +0000 UTC" -> null
      - id              = "playground.ashdavies.dev:GOOGLE_SERVICE_ACCOUNT_ID" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "playground.ashdavies.dev" -> null
      - secret_name     = "GOOGLE_SERVICE_ACCOUNT_ID" -> null
      - updated_at      = "2025-07-25 11:21:53 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # github_actions_secret.main["FASTLANE_SERVICE_ACCOUNT_KEY"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "FASTLANE_SERVICE_ACCOUNT_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.main["FIREBASE_ANDROID_APP_ID"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "FIREBASE_ANDROID_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.main["FIREBASE_GOOGLE_SERVICES"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "FIREBASE_GOOGLE_SERVICES"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.main["GOOGLE_SERVICE_ACCOUNT_ID"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "GOOGLE_SERVICE_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.main["RELEASE_KEYSTORE_FILE"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "RELEASE_KEYSTORE_FILE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.main["RELEASE_KEYSTORE_PROPERTIES"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "RELEASE_KEYSTORE_PROPERTIES"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.main["WORKLOAD_IDENTITY_PROVIDER"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "WORKLOAD_IDENTITY_PROVIDER"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.workload_identity_provider will be destroyed
  # (because github_actions_secret.workload_identity_provider is not in configuration)
  - resource "github_actions_secret" "workload_identity_provider" {
      - created_at      = "2025-07-25 09:05:55 +0000 UTC" -> null
      - id              = "playground.ashdavies.dev:WORKLOAD_IDENTITY_PROVIDER" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "playground.ashdavies.dev" -> null
      - secret_name     = "WORKLOAD_IDENTITY_PROVIDER" -> null
      - updated_at      = "2025-07-25 09:05:55 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # google_service_account_key.fastlane_supply_key will be created
  + resource "google_service_account_key" "fastlane_supply_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = "projects/playground-1a136/serviceAccounts/fastlane-supply@playground-1a136.iam.gserviceaccount.com"
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.fastlane-service-account.google_service_account.service_accounts["fastlane-supply"] will be updated in-place
  ~ resource "google_service_account" "service_accounts" {
      ~ display_name = "fastlane-supply" -> "Fastlane Service Account"
        id           = "projects/playground-1a136/serviceAccounts/fastlane-supply@playground-1a136.iam.gserviceaccount.com"
        name         = "projects/playground-1a136/serviceAccounts/fastlane-supply@playground-1a136.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 4 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->